cypress/Artillery/test.yml
config:
  target: "https://coronavirus.m.pipedream.net/"
  phases:
    - duration: 5
      arrivalRate: 12
      name: Stress Test
  plugins:
    ensure: {}
  ensure:
    thresholds:
      - http.response_time.p95: 4000
    conditions:
      - expression: vusers.failed < 5
      - expression: "http.request_rate >= 2 and http.response_time.max < 10000"
scenarios:
  - name: Getting a resource
    flow:
      - get:
          url: "{{ target }}get"
      - post:
          url: "{{ target }}post"
          # json:
          #   username: "Test User"
          #   password: "Temp Password"
          capture:
            - json: "$.json"
              as: "request_body"
            - json: "$.headers.Host"
              as: "host"
      - log: "Json value from response is: {{request_body}}"
      - log: "Host value from response is: {{host}}"